In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.read_csv('blocks.csv', header=0, names=['row', 'block'])
df1.head()

   row                     block
0    1  blk_-1608999687919862906
1    2  blk_-1608999687919862906
2    3  blk_-1608999687919862906
3    4  blk_-1608999687919862906
4    5  blk_-1608999687919862906

In [3]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11175629 entries, 0 to 11175628
Data columns (total 2 columns):
 #   Column  Dtype
---  ------  -----
 0   row     int64
 1   block   object
dtypes: int64(1), object(1)
memory usage: 170.5+ MB

In [4]:
df1['sequence_in_block'] = df1.groupby(['block']).cumcount()+1
df1.head()

   row                     block  sequence_in_block
0    1  blk_-1608999687919862906                  1
1    2  blk_-1608999687919862906                  2
2    3  blk_-1608999687919862906                  3
3    4  blk_-1608999687919862906                  4
4    5  blk_-1608999687919862906                  5

In [5]:
df1.iloc[10:20]

    row                     block  sequence_in_block
10   11  blk_-1608999687919862906                 11
11   12  blk_-1608999687919862906                 12
12   13  blk_-1608999687919862906                 13
13   14   blk_7503483334202473044                  1
14   15   blk_7503483334202473044                  2
15   16   blk_7503483334202473044                  3
16   17  blk_-1608999687919862906                 14
17   18  blk_-1608999687919862906                 15
18   19   blk_7503483334202473044                  4
19   20  blk_-3544583377289625738                  1

In [6]:
df2 = pd.read_csv('anomaly_label.csv', header=0, names=['block', 'label'])
df2.head()

                      block    label
0  blk_-1608999687919862906   Normal
1   blk_7503483334202473044   Normal
2  blk_-3544583377289625738  Anomaly
3  blk_-9073992586687739851   Normal
4   blk_7854771516489510256   Normal

In [7]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 575061 entries, 0 to 575060
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   block   575061 non-null  object
 1   label   575061 non-null  object
dtypes: object(2)
memory usage: 8.8+ MB

In [8]:
df1['block'].nunique()

575061

In [9]:
df2['block'].nunique()

575061

In [10]:
df_labels = pd.merge(df1, df2, how='left', on='block', left_index=True)
df_labels.head()

   row                     block  sequence_in_block   label
0    1  blk_-1608999687919862906                  1  Normal
0    2  blk_-1608999687919862906                  2  Normal
0    3  blk_-1608999687919862906                  3  Normal
0    4  blk_-1608999687919862906                  4  Normal
0    5  blk_-1608999687919862906                  5  Normal

In [11]:
df_labels.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11175629 entries, 0 to 213289
Data columns (total 4 columns):
 #   Column             Dtype
---  ------             -----
 0   row                int64
 1   block              object
 2   sequence_in_block  int64
 3   label              object
dtypes: int64(2), object(2)
memory usage: 426.3+ MB

In [12]:
df_labels['label'].value_counts()

Normal     10887379
Anomaly      288250
Name: label, dtype: int64

In [13]:
df_labels.to_csv('labels_and_block_id.csv', index=False, header=True)

In [14]:
df_labels.drop('block', axis = 1, inplace = True)
df_labels.to_csv('labels_and_sequence.csv', index=False, header=True)

In [15]:
df_labels.head()

   row  sequence_in_block   label
0    1                  1  Normal
0    2                  2  Normal
0    3                  3  Normal
0    4                  4  Normal
0    5                  5  Normal